Autodesk.Revit.DB.Definition.UnitType
Returns the UnitType of the parameter definition.
Since: 2014

Autodesk.Revit.DB.Definition.ParameterGroup
Returns the group ID of the parameter definition.

Autodesk.Revit.DB.Definition.ParameterType
Returns the user visible interpretation of the parameter data.
Remarks: The data within the parameter is stored in a very simple manner as an integer, double,
string or an element id, but to the user these values may be more meaningful as Length, Volume,
Mass etc. This parameter returns the interpretation that should be used for the data.

Autodesk.Revit.DB.Definition.Name
The user visible name for the parameter.

Autodesk.Revit.DB.Definition
The Definition object is a base object for all type of parameter definitions within the Autodesk Revit API.
Remarks: This object supports properties and methods that report the name and type of a
particular parameter. There are two kinds of definition object derived from this:
InternalDefinition which represents all kinds of definitions existing entirely within the
Autodesk Revit database. ExternalDefinitions represent definitions stored on disk in a
shared parameters file. Most of the time code should be written to utilize this Definition
base class as then the code will be applicable to both internal and external parameter
definitions.